[
  {
    "id": "fdsfsdf",
    "name": "joan",
    "surname": "rowling",
    "image": "https://files.readanybook.com/540816/thumbs/152x264/joanne-rowling.jpg",
    "description": "Joanne Rowling, better known and indeed, EXTREMELY well known around the world as JK Rowling was born in the town of Yate, South Gloucestershire in 1965. She is the most successful literary author of",
    "age": "53",
    "books": [
      {
        "id": "89tgkasdf8239",
        "authorId": "fdsfsdf",
        "name": "Harry Potter and the Sorcerer's Stone",
        "image": "https://images-na.ssl-images-amazon.com/images/I/61GbpzcplyL._SX326_BO1,204,203,200_.jpg",
        "year": "1997",
        "description": "Harry Potter has never been the star of a Quidditch team, scoring points while riding a broom far above the ground. He knows no spells, has never helped to hatch a dragon, and has never worn a cloak of invisibility.",
        "price": "22.99"
      },
      {
        "id": "sadasd3048nhj239",
        "authorId": "fdsfsdf",
        "name": "Harry Potter And The Chamber Of Secrets",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51jNORv6nQL._SX340_BO1,204,203,200_.jpg",
        "year": "1998",
        "description": "The Dursleys were so mean that hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.",
        "price": "29.99"
      },
      {
        "id": "sdfghjghjsdf-324-0",
        "authorId": "fdsfsdf",
        "name": "Harry Potter and the Prisoner of Azkaban",
        "image": "https://hpmedia.bloomsbury.com/rep/s/9780747560777_309834.jpeg",
        "year": "1999",
        "description": "For twelve long years, the dread fortress of Azkaban held an infamous prisoner named Sirius Black. Convicted of killing thirteen people with a single curse, he was said to be the heir apparent to the Dark Lord, Voldemort.",
        "price": "44.99"
      },
      {
        "id": "sdfdhjhgjsdf-324-0",
        "authorId": "fdsfsdf",
        "name": "Harry Potter And The Goblet Of Fire",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51OORp1XD1L._SX421_BO1,204,203,200_.jpg",
        "year": "2000",
        "description": "Harry Potter is midway through his training as a wizard and his coming of age. Harry wants to get away from the pernicious Dursleys and go to the International Quidditch Cup. He wants to find out about the mysterious event that's supposed to take place at Hogwarts this year, an event involving two other rival schools of magic, and a competition that hasn't happened for a hundred years. He wants to be a normal, fourteen-year-old wizard. But unfortunately for Harry Potter, he's not normal - even by wizarding standards. And in his case, different can be deadly.",
        "price": "44.99"
      },
      {
        "id": "sdfdhjhjsdf-324-0",
        "authorId": "fdsfsdf",
        "name": "Harry Potter And The Order Of The Phoenix",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51SfTd37PaL._SX415_BO1,204,203,200_.jpg",
        "year": "2003",
        "description": "In his fifth year at Hogwart's, Harry faces challenges at every turn, from the dark threat of He-Who-Must-Not-Be-Named and the unreliability of the government of the magical world to the rise of Ron Weasley as the keeper of the Gryffindor Quidditch Team. Along the way he learns about the strength of his friends, the fierceness of his enemies, and the meaning of sacrifice.",
        "price": "44.99"
      },
      {
        "id": "sdfsdhjhdf-324-0",
        "authorId": "fdsfsdf",
        "name": "Harry Potter and the Half-Blood Prince",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51KV4CXARLL._SX342_BO1,204,203,200_.jpg",
        "year": "2005",
        "description": "The war against Voldemort is not going well; even the Muggles have been affected. Dumbledore is absent from Hogwarts for long stretches of time, and the Order of the Phoenix has already suffered losses.",
        "price": "40.99"
      },
      {
        "id": "sdfsdjhgdf-324-0",
        "authorId": "fdsfsdf",
        "name": "Harry Potter and the Deathly Hallows",
        "image": "https://images-na.ssl-images-amazon.com/images/I/5128ATd9dSL._SX418_BO1,204,203,200_.jpg",
        "year": "2007",
        "description": "Readers beware. The brilliant, breathtaking conclusion to J.K. Rowling's spellbinding series is not for the faint of heart--such revelations, battles, and betrayals await in Harry Potter and the Deathly Hallows that no fan will make it to the end unscathed. Luckily, Rowling has prepped loyal readers for the end of her series by doling out increasingly dark and dangerous tales of magic and mystery, shot through with lessons about honor and contempt, love and loss, and right and wrong.",
        "price": "44.99"
      }
    ]
  },
  {
    "id": "gr0293840klsd",
    "name": "George",
    "surname": "Martin",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Portrait_photoshoot_at_Worldcon_75%2C_Helsinki%2C_before_the_Hugo_Awards_%E2%80%93_George_R._R._Martin.jpg/220px-Portrait_photoshoot_at_Worldcon_75%2C_Helsinki%2C_before_the_Hugo_Awards_%E2%80%93_George_R._R._Martin.jpg",
    "description": "Fantasy writer George R. R. Martin created 'A Song of Ice and Fire,' one of the most popular book series of today, which includes 1996's 'Game of Thrones.'",
    "age": "69",
    "books": [
      {
        "id": "sa-324-0",
        "authorId": "gr0293840klsd",
        "name": "A Feast for Crows: A Song of Ice and Fire (Game of Thrones)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51TgwgsDjAL._SX302_BO1,204,203,200_.jpg",
        "year": "20xx",
        "description": "Few books have captivated the imagination and won the devotion and praise of readers and critics everywhere as has George R. R. Martin’s monumental epic cycle of high fantasy. Now, in A Feast for Crows, Martin delivers the long-awaited fourth book of his landmark series, as a kingdom torn asunder finds itself at last on the brink of peace",
        "price": "12.34"
      },
      {
        "id": "hjhg-324-0",
        "authorId": "gr0293840klsd",
        "name": "A Storm of Swords (A Song of Ice and Fire, Book 3)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51e6nhYq5TL._SX303_BO1,204,203,200_.jpg",
        "year": "20xx",
        "description": "Of the five contenders for power, one is dead, another in disfavor, and still the wars rage as violently as ever, as alliances are made and broken. Joffrey, of House Lannister, sits on the Iron Throne, the uneasy ruler of the land of the Seven Kingdoms. His most bitter rival, Lord Stannis, stands defeated and disgraced, the victim of the jealous sorceress who holds him in her evil thrall. But young Robb, of House Stark, still rules the North from the fortress of Riverrun",
        "price": "32.34"
      },
      {
        "id": "erte-324-0",
        "authorId": "gr0293840klsd",
        "name": "A Game of Thrones (A Song of Ice and Fire, Book 1)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41SSP8asrUL._SX304_BO1,204,203,200_.jpg",
        "year": "20xx",
        "description": "From a master of contemporary fantasy comes the first novel of a landmark series unlike any you’ve ever read before. With A Game of Thrones, George R. R. Martin has launched a genuine ",
        "price": "32.34"
      },
      {
        "id": "kljkljk;-324-0",
        "authorId": "gr0293840klsd",
        "name": "A Clash of Kings (A Song of Ice and Fire, Book 2)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51QKXAcKUGL._SX302_BO1,204,203,200_.jpg",
        "year": "20xx",
        "description": "In this eagerly awaited sequel to A Game of Thrones, George R. R. Martin has created a work of unsurpassed vision, power, and imagination. A Clash of Kings transports us to a world of revelry and revenge, wizardry and warfare unlike any you have ever experienced.",
        "price": "32.34"
      },
      {
        "id": "sdfsdf-3jhke24-0",
        "authorId": "gr0293840klsd",
        "name": "A Dance with Dragons (A Song of Ice and Fire)",
        "image": "https://images-na.ssl-images-amazon.com/images/I/511P60EPvaL._SX301_BO1,204,203,200_.jpg",
        "year": "20xx",
        "description": "Dubbed “the American Tolkien” by Time magazine, George R. R. Martin has earned international acclaim for his monumental cycle of epic fantasy. Now the #1 New York Times bestselling author delivers the fifth book in his landmark series—as both familiar faces and surprising new forces vie for a foothold in a fragmented empire. ",
        "price": "32.34"
      }
    ]
  },
  {
    "id": "3242309j",
    "name": "Jack",
    "surname": "London",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Jack_London_young.jpg/220px-Jack_London_young.jpg",
    "description": "Jack London was born John Griffith Chaney on January 12, 1876, in San Francisco, California. After working in the Klondike, London returned home and began publishing stories. His novels, including The Call of the Wild, White Fang and Martin Eden, placed London among the most popular American authors of his time. London, who was also a journalist and an outspoken socialist, died in 1916.",
    "age": "40",
    "books": [
      {
        "id": "sa-asdasdsaf343-0",
        "authorId": "3242309j",
        "name": "The Call of the Wild",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51biMTWCm2L._SX310_BO1,204,203,200_.jpg",
        "year": "1903",
        "description": "Jack London's novels and ruggedly individual life seemed to embody American hopes, frustrations, and romantic longings in the turbulent first years of the twentieth century, years infused with the wonder and excitement of great technological and historic change. The author's restless spirit, taste for a life of excitement, and probing mind led him on a series of hard-edged adventures from the Klondike to the South Seas. Out of these sometimes harrowing experiences — and his fascination with the theories of such thinkers as Darwin, Spencer, and Marx — came the inspiration for novels of adventure that would make him one of America’s most popular writers.",
        "price": "99.99"
      }
    ]
  }
]